Show / Hide Table of Contents
Class PolygonPointID
Polygon of pointIDs
Inheritance
System.Object
PolygonPointID
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Result
Assembly: IdeaRS.OpenModel.dll
Syntax
[Obfuscation(Feature = "renaming")]
public class PolygonPointID
Constructors
Improve this Doc   View Source
PolygonPointID()
Constructor
Declaration
public PolygonPointID()
Properties
Improve this Doc   View Source
Points
Points
Declaration
public List<PointOfID> Points { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<PointOfID>
 Improve this Doc
 View Source